sources/history-service/HistoryService.wsdl

<wsdl:definitions xmlns:dpws="http://docs.oasis-open.org/ws-dd/ns/dpws/2009/01" xmlns:mdpws="http://standards.ieee.org/downloads/11073/11073-20702-2016" xmlns:s12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:hs="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:hm="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.2" targetNamespace="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
	<wsdl:import namespace="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.2" location="HistoryModel.xsd"/>
	<wsdl:message name="HistoricMdibReport">
		<wsdl:part name="parameters" element="hm:ChangeSequenceReport"/>
	</wsdl:message>
	<wsdl:portType name="HistoryService" wse:EventSource="true">
		<wsdl:operation name="HistoricMdibReport">
			<wsdl:output message="hs:HistoricMdibReport" wsam:Action="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1.2">
				<wsdl:documentation>
					The action URI urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1.2 uniquely identifies the history service notification output. It is a sub-node to the history service identifier urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1.
				</wsdl:documentation>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="HistoryServiceBinding" type="hs:HistoryService">
		<s12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsp:Policy>
			<dpws:Profile wsp:Optional="true"/>
			<mdpws:Profile wsp:Optional="true"/>
		</wsp:Policy>
		<wsdl:operation name="HistoricMdibReport">
			<s12:operation soapAction="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1.2"/>
			<wsdl:output>
				<s12:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
</wsdl:definitions>
