asciidoc/listings/vol2-clause-appendix-a-mdpws-dev-32-example-04.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
		xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
		xmlns:wsa="http://www.w3.org/2005/08/addressing"
		xmlns:hm="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.2"
>
	<s12:Header>
		<wsa:Action>urn:oid:1.3.6.1.4.1.3592.2.6934.1.1.1</wsa:Action>
		<wsa:MessageID>urn:uuid:6df655f6-5b50-11ed-9b6a-0242ac120002</wsa:MessageID>
		<wsa:To>https://127.0.0.1:6464/EventSink/NotifyTo/56db24f3-b210-40d6-9579-6dd750b1a01a</wsa:To>
	</s12:Header>
	<s12:Body>
		<hm:ChangeSequenceReport/>
	</s12:Body>
</s12:Envelope>
